import React, { Component } from 'react';
import { Col, Nav, Container, Tab, Row } from 'react-bootstrap';

export default class Models extends Component {
    render() {
        return (

            <Container>
                <Tab.Container id="ledt-tabs-example" defaultActiveKey="first">
                    <Row>
                        <Col sm={3}>
                            <Nav variant="pills" className="flex-column mt-2 text-center">
                                <Nav.Item>
                                    <Nav.Link eventKey="mazda-cx-30">Mazda cx-30</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="mazda-6">Mazda 6</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="mazda-cx-5">Mazda cx-5</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="mazda-cx-7">Mazda cx-7</Nav.Link>
                                </Nav.Item>
                                <Nav.Item>
                                    <Nav.Link eventKey="mazda-cx-9">Mazda cx-9</Nav.Link>
                                </Nav.Item>
                            </Nav>
                        </Col>
                        <Col sm={9}>
                            <Tab.Content className="mt-3">
                                <Tab.Pane eventKey="mazda-cx-30">
                                    <img style={{ width: "800px" }} src="https://images.drive.ru/i/0/5f644952ec05c47b6400001a.jpg" alt="mazda-cx-30" />
                                    <p>
                                        У світі постійних викликів, вам потрібен автомобіль, який долає ці виклики разом з вами. Автомобіль, що гармонійно поєднує спортивні лінії купе та сміливу міць кросовера. Компактні розміри кузова, що дозволяють з легкістю мчати містом, і в той же час просторий салон, щоб втекти від міської метушні та подорожуючи насолоджуватись комфортом та затишком.

                                    Новий компактний кросовер має нову платформу Skyactiv-Vehicle Architecture, яка у поєднанні з інтелектуальними технологіями, такими як покращена система повного приводу i-Activ AWD, що працює спільно з Системою контролю руху автомобіля G-Vectoring Control Plus (GVC Plus) та розширений пакет активної безпеки i-Activsense – все це сприяє ще яскравішим враженням від керування автомобілем в дусі філософії Jinba Ittai.

                                    Mazda CX-30 – ідеальне доповнення вашого образу життя, яке робить кожну подорож незабутньою!
                                    </p>
                                </Tab.Pane>
                            </Tab.Content>
                            <Tab.Content>
                                <Tab.Pane eventKey="mazda-6">
                                    <img style={{ width: "800px" }} src="https://a.d-cd.net/GUAAAgMaXuA-960.jpg" alt="mazda-6" />
                                    <p>
                                        Mazda6 пропонує якість та вишуканість, піднесені на ще вищий рівень. Вирізняйтесь на дорозі завдяки ретельно продуманому, елегантному та витонченому дизайну екстер’єру. Нові технології вдосконалюють роботу силових агрегатів SKYACTIV, а динаміку керування було покращено завдяки підвищеній жорсткості кузова, перегляду систем керування й гальмування, вищій аеродинамічній ефективності та зниженню шуму і вібрацій. В салоні на вас чекають сидіння, оббиті шкірою Nappa* з вентиляцією*, натуральне дерево*, оздоблення інноваційним мікроволокном Ultrasuede®* та найсучасніші технології безпеки і комунікацій*. Все це разом створює автомобіль, проводити час у якому – одне задоволення.
                                        
                                    </p>
                                </Tab.Pane>
                            </Tab.Content>
                            <Tab.Content>
                                <Tab.Pane eventKey="mazda-cx-5">
                                    <img style={{ width: "800px" }} src="https://cdn.drivek.it/configurator-covermobile/cars/gb/$original$/MAZDA/CX-5/39641_SUV-5-DOORS/mazda-cx-5-my19-cover-mobile.jpg" alt="mazda-cx-5" />
                                    <p>
                                        Зовні та всередині Mazda CX-5 уособлює якість та вишуканість. Вирізняйтесь на дорозі завдяки продуманому, елегантному та витонченому дизайну екстер’єру.
                                        Нові технології вдосконалюють роботу силових агрегатів SKYACTIV. Динаміку керування було покращено завдяки підвищеній жорсткості кузова, перегляду систем керування й гальмування, покращеній аеродинамічній ефективності та зниженню шуму й вібрацій.
                                        В салоні на вас чекають сидіння, оббиті шкірою Nappa*, натуральне дерево* та найсучасніші технології комунікацій.
                                        Передові системи активної безпеки i-Activsense надають водію ще більше допомоги в дорозі та дозволяють розслабитись та отримувати задоволення від поїздки. Насолоджуйтесь всіма перевагами Mazda СХ-5!
                                    </p>
                                </Tab.Pane>
                            </Tab.Content>
                            <Tab.Content>
                                <Tab.Pane eventKey="mazda-cx-7">
                                    <img style={{ width: "800px" }} src="https://lh3.googleusercontent.com/proxy/VAFoaz-7nMsX9gyyyuEYEr1lhMoYr6hUN0rj7sWlJOWAwsz5VI0wG9mEPFc-wYiGNGY4vU6KzEQBQFNNMUb-Kxd1" alt="mazda-cx7" />
                                    <p>
                                        Mazda CX-7 побудована на новій платформі, однак майже всі компоненти запозичені у інших моделей. Передня підвіска — від мінівена Mazda MPV, задня підвіска — злегка модифікована підвіска від моделі Mazda 3, один з двигунів 2.3 л MZR turbocharged — від Mazda6 MPS, але дефорсований до 238 к.с., звідти ж і повноприводна трансмісія з багатодисковою електронно-керованою муфтою в приводі задніх коліс. Коробка передач являє собою 6-ступінчасту АКПП Active matic з режимом ручного перемикання або 6-ступінчасту МКПП.

                                        За словами шеф-дизайнера концерну Mazda Івао Коїдзумі, зовнішність моделі CX-7 він придумав, перебуваючи у фітнес-центрі. Екстер'єр кроссовера якраз являє приклад спортивного підходу до створення міського повнопривідного автомобіля, і зовнішність машини багато в чому перегукується з інтер'єром.

                                        Усі моделі Mazda CX-7 оснащені такими стандартними системами безпеки, як: контроль стабільності, антиблокувальні гальма, система допомоги при гальмуванні та моніторинг тиску в шинах. Крім того, переднього пасажира та водія захищатимуть передні та бокові подушки безпеки, а бокові завіси захищатимуть обидва ряди сидінь[1].
                                    </p>
                                </Tab.Pane>
                            </Tab.Content>
                            <Tab.Content>
                                <Tab.Pane eventKey="mazda-cx-9">
                                    <img style={{ width: "800px" }} src="https://lh3.googleusercontent.com/proxy/2fND20UEoS24rpDO8OGcnxjMPndqL3wDdO2x2MLeX6GB0DGggzhkB0GDTz4aXboIAlEalWwNTdSCC4y-DeqDvHxv3Q" alt="mazda" />
                                    <p>
                                        7-місний кросовер Mazda CX-9 викликає однакове захоплення, коли дивишся на нього, сидиш у салоні або подорожуєш у ньому, і залишається гідним найвищих похвал завдяки висококласному дизайну, преміальному оснащенню інтер’єру, натхненному задоволенням від керування та інноваційними технологіями SKYACTIV.

                                        Цей автомобіль є втіленням досягнень Mazda у сфері інноваційних силових агрегатів, захопливого динамічного руху, преміальної якості та еволюції відзначеного численними нагородами дизайну «KODO – Душа Руху». Сфера його                                         використання майже необмежена завдяки безпроблемній експлуатації за будь-якої погоди з системою повного                                         приводу i-ACTIV 4WD та одним із найкращих у класі показникам витрати пального.
                                     </p>
                                </Tab.Pane>
                            </Tab.Content>
                        </Col>
                    </Row>
                </Tab.Container>
            </Container>
        );
    }
}
